<?php


$config = [
    'subject' => '2016q4',
    'from'    => '2016-10-01 00:00:00',
    'to'      => '2016-12-31 23:59:59',
    // 目标修正金额
    'total'   => [
        'de' => ['2016-10' => 100, '2016-11' => 100, '2016-12' => 100],
        'pt' => ['2016-10' => 100, '2016-11' => 100, '2016-12' => 100],
    ],
    // 审计库
    'audit'   => ['host' => '127.0.0.1', 'port' => 3306, 'db' => 'audit', 'user' => 'dev', 'pass' => 'dev123456'],
    // 平台库(订单库TRADE)
    'trade'   => [
        'de' => ['host' => '127.0.0.1', 'port' => 3306, 'db' => 'app_100', 'user' => 'dev', 'pass' => 'dev123456'],
        'pt' => ['host' => '127.0.0.1', 'port' => 3306, 'db' => 'app_100', 'user' => 'dev', 'pass' => 'dev123456'],
    ],
    // 游戏库(消耗EXP)
    'servers' => [
        'de' => [
            '1001' => ['host' => '127.0.0.1', 'port' => 3306, 'db' => 'app_100', 'user' => 'dev', 'pass' => 'dev123456'],
        ],
        'pt' => [
            '2001' => ['host' => '127.0.0.1', 'port' => 3306, 'db' => 'app_100', 'user' => 'dev', 'pass' => 'dev123456'],
        ],
    ],
];


return $config;